In [1]:
from pyspark import SparkContext, SparkConf
from pyspark import sql
from pyspark.sql import Row                       # To use Row method for column
#from pyspark.sql import functions as F
from pyspark.sql.functions import *
from pyspark.sql.types import *
from pyspark.sql import Window

In [2]:
conf = SparkConf().set("spark.executor.memory", "4g")
sc = SparkContext(conf=conf)
sqlContext = sql.SQLContext(sc)

In [3]:
sc._conf.set("spark.driver.memory","3")
sc._conf.set("spark.sql.crossJoin.enabled", "true")

In [4]:
sc._conf.getAll()

[(u'spark.driver.port', u'35939'),
 (u'spark.sql.crossJoin.enabled', u'true'),
 (u'spark.driver.host', u'192.168.0.42'),
 (u'spark.rdd.compress', u'True'),
 (u'spark.executor.memory', u'4g'),
 (u'spark.serializer.objectStreamReset', u'100'),
 (u'spark.master', u'local[*]'),
 (u'spark.driver.memory', u'3'),
 (u'spark.executor.id', u'driver'),
 (u'spark.submit.deployMode', u'client'),
 (u'spark.app.id', u'local-1543916372737'),
 (u'spark.ui.showConsoleProgress', u'true'),
 (u'spark.app.name', u'pyspark-shell')]

In [5]:
sc._conf.get("spark.submit.deployMode")

u'client'

In [6]:
m = sc.parallelize([(1, 2), (3, 4)]).collectAsMap()

m

{1: 2, 3: 4}

In [7]:
#Tricky RDD Example with dict type

sam = sc.parallelize((['A',1,1],['B',1,2],['C',1,5],['D',2,3],['A',2,1],['B',2,5],['C',2,3],['D',2,1]))

df_sample = sqlContext.createDataFrame(sam, ['C1','C2','C3'])

sa = df_sample.rdd

sa1 = sa.map(lambda x: (x[0],(x[1],x[2])))

sa1.collect()

sa2 = sa1.groupByKey().map(lambda x : (x[0], dict(list(x[1]))))

sa3 = sqlContext.createDataFrame(sa2, ['C1', 'C2C3'])

sa3.show()

+---+----------------+
| C1|            C2C3|
+---+----------------+
|  A|[1 -> 1, 2 -> 1]|
|  C|[1 -> 5, 2 -> 3]|
|  B|[1 -> 2, 2 -> 5]|
|  D|        [2 -> 1]|
+---+----------------+

In [8]:
sam = sc.parallelize((['A',1,1],['B',1,2],['C',1,5],['D',2,3],['A',2,1],['B',2,5],['C',2,3],['D',2,1]))

df_sample = sqlContext.createDataFrame(sam, ['C1','C2','C3'])

sa = df_sample.rdd

a = sa.filter(lambda x: 'B' in x[0]).map(lambda x: ((x[1]), (x[2])))

print(a.collectAsMap()[2])

a.collect()

5

[(1, 2), (2, 5)]

In [9]:
empRDD = sc.textFile("emp.txt")
depRDD = sc.textFile("dept.txt")
salRDD = sc.textFile("salgrade.txt")

In [10]:
emp_col = Row('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO')
dep_col = Row('DEPTNO', 'DNAME', 'DLOC')
sal_col = Row('GRADE', 'LOSAL', 'HISAL')

In [11]:
empROW = empRDD.map(lambda x: x.split(',')).map(lambda r: emp_col(*r))
depRow = depRDD.map(lambda x: x.split(',')).map(lambda r: dep_col(*r))
salROW = salRDD.map(lambda x: x.split(',')).map(lambda r: sal_col(*r))

In [12]:
empDF = sqlContext.createDataFrame(empROW)
depDF = sqlContext.createDataFrame(depRow)
salDF = sqlContext.createDataFrame(salROW)

In [13]:
# Converting Dataframe values to it types

def toInt(i):
    return i.cast("integer")

def toDouble(d):
    return d.cast("double")

emp = empDF.withColumn("EMPNO", toInt(empDF.EMPNO)).withColumn("MGR", toInt(empDF.MGR)).withColumn("HIREDATE",to_date('HIREDATE')).withColumn("SAL", toDouble(empDF.SAL)).withColumn('COMM', when(empDF.COMM == 'NULL', lit(None)).otherwise(empDF.COMM)).withColumn("DEPTNO", toInt(empDF.DEPTNO)).filter('ENAME != "ENAME"')
dept = depDF.withColumn("DEPTNO", toInt(depDF.DEPTNO)).na.drop()
sal = salDF.withColumn("GRADE", toInt(salDF.GRADE)).withColumn("LOSAL", toDouble(salDF.LOSAL)).withColumn("HISAL", toDouble(salDF.HISAL)).na.drop()

sqlContext.registerDataFrameAsTable(emp, "emptab")
sqlContext.registerDataFrameAsTable(dept, "depttab")
sqlContext.registerDataFrameAsTable(sal, "saltab")

In [14]:
#Assignment to Practice dataframe

In [15]:
# 1) Display all the information of the emp,dept,sal table?

emp.select('*').show()
dept.select('*').show()
sal.select('*').show()

+-----+------+---------+----+----------+------+-------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+---------+----+----------+------+-------+------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|
+-----+------+---------+----+----------+------+-------+------+

+------+----------+--------+
|DEPTNO|     DNAME|    DLOC|
+------+----------+--------+
|    10|ACCOUNTING|NEW YORK|
|    20|  RESEARCH|  DALLAS|
|    30|     SALES| CHICAGO|
|    40|OPERATIONS|  BOSTON|
+------+----------+--------+

+-----+------+------+
|GRADE| LOSAL| HISAL|
+-----+------+------+
|    1| 700.0|1200.0|
|    2|1201.0|1400.0|
|    3|1401.0|2000.0|
|    4|2001.0|3000.0|
|    5|3001.0|9999.0|
+-----+------+------+

In [16]:
# 2. Display unique Jobs from EMP table?

emp.select("JOB").distinct().show()

+---------+
|      JOB|
+---------+
|  ANALYST|
| SALESMAN|
|    CLERK|
|  MANAGER|
|PRESIDENT|
+---------+

In [17]:
# 3. List the emps in the asc order of their Salaries?

emp.sort(asc('SAL')).show()

+-----+------+---------+----+----------+------+-------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+---------+----+----------+------+-------+------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|
+-----+------+---------+----+----------+------+-------+------+

In [18]:
# 4. List the details of the emps in asc order of the Dptnos and desc of Jobs?

emp.sort(asc('DEPTNO'),desc('JOB')).show()

+-----+------+---------+----+----------+------+-------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+---------+----+----------+------+-------+------+
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20|
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|
+-----+------+---------+----+----------+------+-------+------+

In [19]:
# 5. Display all the unique job groups in the descending order?

emp.select("JOB").sort(desc("JOB")).distinct().show()

+---------+
|      JOB|
+---------+
| SALESMAN|
|PRESIDENT|
|  MANAGER|
|    CLERK|
|  ANALYST|
+---------+

In [20]:
sqlContext.registerDataFrameAsTable(emp, "empTab")

sqlContext.sql("Select * from emptab where EMPNO in (select MGR from emptab)").show()

+-----+-----+---------+----+----------+------+----+------+
|EMPNO|ENAME|      JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+-----+---------+----+----------+------+----+------+
| 7788|SCOTT|  ANALYST|7566|1982-12-09|3000.0|null|    20|
| 7902| FORD|  ANALYST|7566|1981-12-03|3000.0|null|    20|
| 7566|JONES|  MANAGER|7839|1981-04-02|2975.0|null|    20|
| 7698|BLAKE|  MANAGER|7839|1981-05-01|2850.0|null|    30|
| 7839| KING|PRESIDENT|null|1981-11-17|5000.0|null|    10|
| 7782|CLARK|  MANAGER|7839|1981-06-09|2450.0|null|    10|
+-----+-----+---------+----+----------+------+----+------+

In [21]:
# 6. Display all the details of all ‘Mgrs’

mgrId = emp.select("MGR").distinct()

mgrIDL = mgrId.rdd.map(lambda x: x[0]).collect()  # x[0]: first column, collect will return []

mgrDet = emp.filter(emp.EMPNO.isin(mgrIDL)) #passing mgrIDL-list inside to filter

mgrDet.show()

+-----+-----+---------+----+----------+------+----+------+
|EMPNO|ENAME|      JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+-----+---------+----+----------+------+----+------+
| 7566|JONES|  MANAGER|7839|1981-04-02|2975.0|null|    20|
| 7698|BLAKE|  MANAGER|7839|1981-05-01|2850.0|null|    30|
| 7782|CLARK|  MANAGER|7839|1981-06-09|2450.0|null|    10|
| 7788|SCOTT|  ANALYST|7566|1982-12-09|3000.0|null|    20|
| 7839| KING|PRESIDENT|null|1981-11-17|5000.0|null|    10|
| 7902| FORD|  ANALYST|7566|1981-12-03|3000.0|null|    20|
+-----+-----+---------+----+----------+------+----+------+

In [22]:
# 7. List the emps who joined before 1981.

emp.filter(year('HIREDATE') < '1981').show()

+-----+-----+-----+----+----------+-----+----+------+
|EMPNO|ENAME|  JOB| MGR|  HIREDATE|  SAL|COMM|DEPTNO|
+-----+-----+-----+----+----------+-----+----+------+
| 7369|SMITH|CLERK|7902|1980-12-17|800.0|null|    20|
+-----+-----+-----+----+----------+-----+----+------+

In [23]:
#Find the name of the highest paied employee

a = emp.withColumn("rank", dense_rank().over(Window.orderBy(desc("SAL"))))

b = a.filter('rank = 1').select('ENAME').show()

+-----+
|ENAME|
+-----+
| KING|
+-----+

In [24]:
#8. List the Empno, Ename, Sal, Daily sal of all emps in the asc order of Annsal.

wid_dS = emp.withColumn("dSAL", emp.SAL/30).withColumn("aSal", emp.SAL*12) #with daily salary

wid_dS.sort(asc('aSal')).show() #wid_asc

+-----+------+---------+----+----------+------+-------+------+------------------+-------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|              dSAL|   aSal|
+-----+------+---------+----+----------+------+-------+------+------------------+-------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20|26.666666666666668| 9600.0|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|31.666666666666668|11400.0|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20|36.666666666666664|13200.0|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|41.666666666666664|15000.0|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|41.666666666666664|15000.0|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|43.333333333333336|15600.0|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|              50.0|18000.0|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|53.333333333333336|19200.0|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10| 81.66666666666667|29400.0|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|              95.0|34200.0|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20| 99.16666666666667|35700.0|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20|             100.0|36000.0|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|             100.0|36000.0|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|166.66666666666666|60000.0|
+-----+------+---------+----+----------+------+-------+------+------------------+-------+

In [25]:
# 9. Display the Empno, Ename, job, Hiredate, Exp of all Mgrs

mgrDet.withColumn("EXP", year(current_date()) - year("HIREDATE")).show()

+-----+-----+---------+----+----------+------+----+------+---+
|EMPNO|ENAME|      JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|EXP|
+-----+-----+---------+----+----------+------+----+------+---+
| 7566|JONES|  MANAGER|7839|1981-04-02|2975.0|null|    20| 37|
| 7698|BLAKE|  MANAGER|7839|1981-05-01|2850.0|null|    30| 37|
| 7782|CLARK|  MANAGER|7839|1981-06-09|2450.0|null|    10| 37|
| 7788|SCOTT|  ANALYST|7566|1982-12-09|3000.0|null|    20| 36|
| 7839| KING|PRESIDENT|null|1981-11-17|5000.0|null|    10| 37|
| 7902| FORD|  ANALYST|7566|1981-12-03|3000.0|null|    20| 37|
+-----+-----+---------+----+----------+------+----+------+---+

In [26]:
# 10.List the Empno, Ename, Sal, Exp of all emps working for Mgr 7839.

emp.filter('MGR = 7839').withColumn("EXP", year(current_date()) - year("HIREDATE")).show()

+-----+-----+-------+----+----------+------+----+------+---+
|EMPNO|ENAME|    JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|EXP|
+-----+-----+-------+----+----------+------+----+------+---+
| 7566|JONES|MANAGER|7839|1981-04-02|2975.0|null|    20| 37|
| 7698|BLAKE|MANAGER|7839|1981-05-01|2850.0|null|    30| 37|
| 7782|CLARK|MANAGER|7839|1981-06-09|2450.0|null|    10| 37|
+-----+-----+-------+----+----------+------+----+------+---+

In [27]:
# 11.Display all the details of the emps whose Comm. Is more than their Sal.

emp.filter('COMM > SAL').show()

+-----+------+--------+----+----------+------+-------+------+
|EMPNO| ENAME|     JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+--------+----+----------+------+-------+------+
| 7654|MARTIN|SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
+-----+------+--------+----+----------+------+-------+------+

In [28]:
# 12. List the emps in the asc order of Designations of those joined after the second half of 1981.

# emp.filter(col("HIREDATE") > '1981-06-01').filter(year(col("HIREDATE")) == 1981).sort(asc('JOB')).show()


emp.filter(col("HIREDATE") > '1981-06-01').filter(year(col("HIREDATE")) == 1981).sort(asc('JOB')).show()

+-----+------+---------+----+----------+------+-------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+---------+----+----------+------+-------+------+
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|
+-----+------+---------+----+----------+------+-------+------+

In [29]:
# 13. List the emps along with their Exp and Daily Sal is more than Rs.100.

emp.select('*', (year(current_date()) - year(emp.HIREDATE)).alias("EXP"), col('SAL')/30).show(truncate=True)

+-----+------+---------+----+----------+------+-------+------+---+------------------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|EXP|        (SAL / 30)|
+-----+------+---------+----+----------+------+-------+------+---+------------------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20| 38|26.666666666666668|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30| 37|53.333333333333336|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30| 37|41.666666666666664|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20| 37| 99.16666666666667|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30| 37|41.666666666666664|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30| 37|              95.0|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10| 37| 81.66666666666667|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20| 36|             100.0|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10| 37|166.66666666666666|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30| 37|              50.0|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20| 35|36.666666666666664|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30| 37|31.666666666666668|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20| 37|             100.0|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10| 36|43.333333333333336|
+-----+------+---------+----+----------+------+-------+------+---+------------------+

In [30]:
# 14. List the emps who are either ‘CLERK’ or ‘ANALYST’ in the Desc order.

emp.filter(emp.JOB.isin('CLERK', 'ANALYST')).orderBy(emp.JOB, ascending = False).show()

emp.filter(emp.JOB.isin('CLERK', 'ANALYST')).sort(desc('JOB')).show() #orderBy(emp.JOB, ascending = False).show()

+-----+------+-------+----+----------+------+----+------+
|EMPNO| ENAME|    JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+------+-------+----+----------+------+----+------+
| 7369| SMITH|  CLERK|7902|1980-12-17| 800.0|null|    20|
| 7934|MILLER|  CLERK|7782|1982-01-23|1300.0|null|    10|
| 7900| JAMES|  CLERK|7698|1981-12-03| 950.0|null|    30|
| 7876| ADAMS|  CLERK|7788|1983-01-12|1100.0|null|    20|
| 7788| SCOTT|ANALYST|7566|1982-12-09|3000.0|null|    20|
| 7902|  FORD|ANALYST|7566|1981-12-03|3000.0|null|    20|
+-----+------+-------+----+----------+------+----+------+

+-----+------+-------+----+----------+------+----+------+
|EMPNO| ENAME|    JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+------+-------+----+----------+------+----+------+
| 7934|MILLER|  CLERK|7782|1982-01-23|1300.0|null|    10|
| 7900| JAMES|  CLERK|7698|1981-12-03| 950.0|null|    30|
| 7876| ADAMS|  CLERK|7788|1983-01-12|1100.0|null|    20|
| 7369| SMITH|  CLERK|7902|1980-12-17| 800.0|null|    20|
| 7788| SCOTT|ANALYST|7566|1982-12-09|3000.0|null|    20|
| 7902|  FORD|ANALYST|7566|1981-12-03|3000.0|null|    20|
+-----+------+-------+----+----------+------+----+------+

In [31]:
# 15. List the emps who joined on 1-MAY-81,3-DEC-81,17-DEC-80,19-JAN-80 in asc order of seniority.

emp.filter(emp.HIREDATE.isin('1981-05-01','1981-12-03','1980-12-17','1980-01-19')).show()

+-----+-----+-------+----+----------+------+----+------+
|EMPNO|ENAME|    JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+-----+-------+----+----------+------+----+------+
| 7369|SMITH|  CLERK|7902|1980-12-17| 800.0|null|    20|
| 7698|BLAKE|MANAGER|7839|1981-05-01|2850.0|null|    30|
| 7900|JAMES|  CLERK|7698|1981-12-03| 950.0|null|    30|
| 7902| FORD|ANALYST|7566|1981-12-03|3000.0|null|    20|
+-----+-----+-------+----+----------+------+----+------+

In [32]:
# 16. List the emp who are working for the Deptno 10 or20.

emp.filter(emp.DEPTNO.isin(10,20)).show()

+-----+------+---------+----+----------+------+----+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+------+---------+----+----------+------+----+------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|null|    20|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|null|    20|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|null|    10|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|null|    20|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|null|    10|
+-----+------+---------+----+----------+------+----+------+

In [33]:
#17. List the emps who are joined in the year 80.

emp.filter(emp.HIREDATE.between('1980-01-01','1980-12-31')).show()

emp.filter(year("HIREDATE") == 1980).show()

+-----+-----+-----+----+----------+-----+----+------+
|EMPNO|ENAME|  JOB| MGR|  HIREDATE|  SAL|COMM|DEPTNO|
+-----+-----+-----+----+----------+-----+----+------+
| 7369|SMITH|CLERK|7902|1980-12-17|800.0|null|    20|
+-----+-----+-----+----+----------+-----+----+------+

+-----+-----+-----+----+----------+-----+----+------+
|EMPNO|ENAME|  JOB| MGR|  HIREDATE|  SAL|COMM|DEPTNO|
+-----+-----+-----+----+----------+-----+----+------+
| 7369|SMITH|CLERK|7902|1980-12-17|800.0|null|    20|
+-----+-----+-----+----+----------+-----+----+------+

In [34]:
#18. List the emps who are joined in the month of Aug 1980.


emp.filter(year('HIREDATE') == 1980).filter(month('HIREDATE') == 12).show()

+-----+-----+-----+----+----------+-----+----+------+
|EMPNO|ENAME|  JOB| MGR|  HIREDATE|  SAL|COMM|DEPTNO|
+-----+-----+-----+----+----------+-----+----+------+
| 7369|SMITH|CLERK|7902|1980-12-17|800.0|null|    20|
+-----+-----+-----+----+----------+-----+----+------+

In [35]:
#19. List the emps Who Annual sal ranging from 22000 and 45000.

emp.filter((emp.SAL*12).between(22000, 45000)).show()

+-----+-----+-------+----+----------+------+----+------+
|EMPNO|ENAME|    JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+-----+-------+----+----------+------+----+------+
| 7566|JONES|MANAGER|7839|1981-04-02|2975.0|null|    20|
| 7698|BLAKE|MANAGER|7839|1981-05-01|2850.0|null|    30|
| 7782|CLARK|MANAGER|7839|1981-06-09|2450.0|null|    10|
| 7788|SCOTT|ANALYST|7566|1982-12-09|3000.0|null|    20|
| 7902| FORD|ANALYST|7566|1981-12-03|3000.0|null|    20|
+-----+-----+-------+----+----------+------+----+------+

In [36]:
#20. List the Enames those are having five characters in their Names.

emp.filter(length(emp.ENAME) == 5).show()

+-----+-----+--------+----+----------+------+------+------+
|EMPNO|ENAME|     JOB| MGR|  HIREDATE|   SAL|  COMM|DEPTNO|
+-----+-----+--------+----+----------+------+------+------+
| 7369|SMITH|   CLERK|7902|1980-12-17| 800.0|  null|    20|
| 7499|ALLEN|SALESMAN|7698|1981-02-20|1600.0|300.00|    30|
| 7566|JONES| MANAGER|7839|1981-04-02|2975.0|  null|    20|
| 7698|BLAKE| MANAGER|7839|1981-05-01|2850.0|  null|    30|
| 7782|CLARK| MANAGER|7839|1981-06-09|2450.0|  null|    10|
| 7788|SCOTT| ANALYST|7566|1982-12-09|3000.0|  null|    20|
| 7876|ADAMS|   CLERK|7788|1983-01-12|1100.0|  null|    20|
| 7900|JAMES|   CLERK|7698|1981-12-03| 950.0|  null|    30|
+-----+-----+--------+----+----------+------+------+------+

In [37]:
#21. List the Enames those are starting with ‘S’ and with five characters.

emp.filter(length(emp.ENAME) == 5).filter(substring(col('ENAME'),0,1) == 'S').show()

+-----+-----+-------+----+----------+------+----+------+
|EMPNO|ENAME|    JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+-----+-------+----+----------+------+----+------+
| 7369|SMITH|  CLERK|7902|1980-12-17| 800.0|null|    20|
| 7788|SCOTT|ANALYST|7566|1982-12-09|3000.0|null|    20|
+-----+-----+-------+----+----------+------+----+------+

In [38]:
#22. List the emps those are having four chars and third character must be ‘r’.

emp.filter(length('ENAME') == 4).filter(substring(col('ENAME'),3,1) == 'R').show()

+-----+-----+--------+----+----------+------+------+------+
|EMPNO|ENAME|     JOB| MGR|  HIREDATE|   SAL|  COMM|DEPTNO|
+-----+-----+--------+----+----------+------+------+------+
| 7521| WARD|SALESMAN|7698|1981-02-22|1250.0|500.00|    30|
| 7902| FORD| ANALYST|7566|1981-12-03|3000.0|  null|    20|
+-----+-----+--------+----+----------+------+------+------+

In [39]:
# 28. List the emps those who joined in 80’s.

emp.filter(year("HIREDATE") == 1980).show()

+-----+-----+-----+----+----------+-----+----+------+
|EMPNO|ENAME|  JOB| MGR|  HIREDATE|  SAL|COMM|DEPTNO|
+-----+-----+-----+----+----------+-----+----+------+
| 7369|SMITH|CLERK|7902|1980-12-17|800.0|null|    20|
+-----+-----+-----+----+----------+-----+----+------+

In [40]:
# 29. List the emps who does not belong to Deptno 20.

emp.filter("DEPTNO != 20").show()

+-----+------+---------+----+----------+------+-------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+---------+----+----------+------+-------+------+
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|
+-----+------+---------+----+----------+------+-------+------+

In [41]:
# 30. List all the emps except ‘PRESIDENT’ & ‘MGR” in asc order of Salaries.

emp.filter(~emp.JOB.isin('PRESIDENT', 'MGR')).show()

+-----+------+--------+----+----------+------+-------+------+
|EMPNO| ENAME|     JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+--------+----+----------+------+-------+------+
| 7369| SMITH|   CLERK|7902|1980-12-17| 800.0|   null|    20|
| 7499| ALLEN|SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|
| 7521|  WARD|SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|
| 7566| JONES| MANAGER|7839|1981-04-02|2975.0|   null|    20|
| 7654|MARTIN|SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7698| BLAKE| MANAGER|7839|1981-05-01|2850.0|   null|    30|
| 7782| CLARK| MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7788| SCOTT| ANALYST|7566|1982-12-09|3000.0|   null|    20|
| 7844|TURNER|SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|
| 7876| ADAMS|   CLERK|7788|1983-01-12|1100.0|   null|    20|
| 7900| JAMES|   CLERK|7698|1981-12-03| 950.0|   null|    30|
| 7902|  FORD| ANALYST|7566|1981-12-03|3000.0|   null|    20|
| 7934|MILLER|   CLERK|7782|1982-01-23|1300.0|   null|    10|
+-----+------+--------+----+----------+------+-------+------+

In [42]:
# 31. List all the emps who joined before or after 1981.

emp.filter(year("HIREDATE") != 1981).show()

+-----+------+-------+----+----------+------+----+------+
|EMPNO| ENAME|    JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+------+-------+----+----------+------+----+------+
| 7369| SMITH|  CLERK|7902|1980-12-17| 800.0|null|    20|
| 7788| SCOTT|ANALYST|7566|1982-12-09|3000.0|null|    20|
| 7876| ADAMS|  CLERK|7788|1983-01-12|1100.0|null|    20|
| 7934|MILLER|  CLERK|7782|1982-01-23|1300.0|null|    10|
+-----+------+-------+----+----------+------+----+------+

In [43]:
# 32. List the emps whose Empno not starting with digit78.

emp.filter(~emp.EMPNO.like('78%')).show()

+-----+------+--------+----+----------+------+-------+------+
|EMPNO| ENAME|     JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+--------+----+----------+------+-------+------+
| 7369| SMITH|   CLERK|7902|1980-12-17| 800.0|   null|    20|
| 7499| ALLEN|SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|
| 7521|  WARD|SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|
| 7566| JONES| MANAGER|7839|1981-04-02|2975.0|   null|    20|
| 7654|MARTIN|SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7698| BLAKE| MANAGER|7839|1981-05-01|2850.0|   null|    30|
| 7782| CLARK| MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7788| SCOTT| ANALYST|7566|1982-12-09|3000.0|   null|    20|
| 7900| JAMES|   CLERK|7698|1981-12-03| 950.0|   null|    30|
| 7902|  FORD| ANALYST|7566|1981-12-03|3000.0|   null|    20|
| 7934|MILLER|   CLERK|7782|1982-01-23|1300.0|   null|    10|
+-----+------+--------+----+----------+------+-------+------+

In [44]:
# 33. List the emps who are working under ‘MGR’.

# select e.ename || ‘ works for ‘ || m.ename from emp e ,emp m where e.mgr =
# m.empno ;

empE = emp
empM = emp

empE.join(empM, empE.EMPNO == empM.MGR) #.select('*').show()

#emp.alias("a").join(b.alias("b"), joinExprs)

#e.mgr = m.empno

DataFrame[EMPNO: int, ENAME: string, JOB: string, MGR: int, HIREDATE: date, SAL: double, COMM: string, DEPTNO: int, EMPNO: int, ENAME: string, JOB: string, MGR: int, HIREDATE: date, SAL: double, COMM: string, DEPTNO: int]

In [45]:
# 34. List the emps who joined in any year but not belongs to the month of March.

emp.filter(month(emp.HIREDATE) != 03).show()

+-----+------+---------+----+----------+------+-------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+---------+----+----------+------+-------+------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|
+-----+------+---------+----+----------+------+-------+------+

In [46]:
# 35. List all the Clerks of Deptno 20

emp.filter("JOB = 'CLERK'").filter(col("DEPTNO") == 20).show()

+-----+-----+-----+----+----------+------+----+------+
|EMPNO|ENAME|  JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|
+-----+-----+-----+----+----------+------+----+------+
| 7369|SMITH|CLERK|7902|1980-12-17| 800.0|null|    20|
| 7876|ADAMS|CLERK|7788|1983-01-12|1100.0|null|    20|
+-----+-----+-----+----+----------+------+----+------+

In [47]:
# find A,B groups 2nd key value

sam = sc.parallelize((['A',1,1],['B',1,2],['C',1,5],['D',2,3],['A',2,1],['B',2,5],['C',2,3],['D',2,1]))

df_sample = sqlContext.createDataFrame(sam, ['C1','C2','C3'])

sa = df_sample.rdd


def abc(sa, r, k):
    i = 0
    s = []
    while i < len(r):
        at = r[i]
        a = sa.filter(lambda x: at in x[0]).map(lambda x: ((x[1]), (x[2])))
        i = i+1
        print(a.collectAsMap()[k])
        

h = abc(sa, ['A', 'B'], 2)

1
5

In [48]:
# UDF example
sam = sc.parallelize((['A',1,1],['B',1,2],['C',1,5],['D',2,3],['A',2,1],['B',2,5],['C',2,3],['D',2,1]))

df_sample = sqlContext.createDataFrame(sam, ['C1','C2','C3'])

def grp(c2, c3):
    return [c2, c3]

array_schema = StructType([
    StructField('c2', IntegerType(), nullable=False),
    StructField('c3', StringType(), nullable=False)
])

grp_udf = udf(lambda x,z: grp(x,z), array_schema)

grp_df = df_sample.select('C1', grp_udf("c2", "c3").alias('C2C3')).filter("C2C3.c2 == 2")

# groupBy("C1").agg(collect_list("C2C3"))

grp_df.show()

+---+------+
| C1|  C2C3|
+---+------+
|  D|[2, 3]|
|  A|[2, 1]|
|  B|[2, 5]|
|  C|[2, 3]|
|  D|[2, 1]|
+---+------+

In [49]:
# 36. List the emps of Deptno 30 or 10 joined in the year 1981.

emp.filter((year("HIREDATE") == 1981) & (col("DEPTNO").isin([10,30]))).show()

+-----+------+---------+----+----------+------+-------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|
+-----+------+---------+----+----------+------+-------+------+
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|
+-----+------+---------+----+----------+------+-------+------+

In [50]:
# 37. Display the details of SMITH.

emp.filter(col("ENAME") == 'SMITH').show()

+-----+-----+-----+----+----------+-----+----+------+
|EMPNO|ENAME|  JOB| MGR|  HIREDATE|  SAL|COMM|DEPTNO|
+-----+-----+-----+----+----------+-----+----+------+
| 7369|SMITH|CLERK|7902|1980-12-17|800.0|null|    20|
+-----+-----+-----+----+----------+-----+----+------+

In [51]:
# 38. Display the location of SMITH.

emp.alias("e").join(dept.alias("d"), [col("e.DEPTNO") == col("d.DEPTNO"), col("e.ENAME") == "SMITH"]).select("DLOC").show()

+------+
|  DLOC|
+------+
|DALLAS|
+------+

In [52]:
# 39. List the total information of EMP table along with DNAME and Loc of all the
# emps Working Under ‘ACCOUNTING’ & ‘RESEARCH’ in the asc Deptno.

emp.alias("e").join(dept.alias("d"), [col("e.DEPTNO") == col("d.DEPTNO"), col("d.DNAME").isin("ACCOUNTING", "RESEARCH")]).sort(asc("e.DEPTNO")).show()

+-----+------+---------+----+----------+------+----+------+------+----------+--------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|DEPTNO|     DNAME|    DLOC|
+-----+------+---------+----+----------+------+----+------+------+----------+--------+
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|null|    10|    10|ACCOUNTING|NEW YORK|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|null|    10|    10|ACCOUNTING|NEW YORK|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|null|    10|    10|ACCOUNTING|NEW YORK|
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|null|    20|    20|  RESEARCH|  DALLAS|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|null|    20|    20|  RESEARCH|  DALLAS|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|null|    20|    20|  RESEARCH|  DALLAS|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|null|    20|    20|  RESEARCH|  DALLAS|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|null|    20|    20|  RESEARCH|  DALLAS|
+-----+------+---------+----+----------+------+----+------+------+----------+--------+

In [53]:
# 40. List the Empno, Ename, Sal, Dname of all the ‘MGRS’ and ‘ANALYST’
# working in New York, Dallas with an exp more than 7 years without receiving the
# Comm asc order of Loc.

emp.alias("e").join(emp.alias("m"), [col("e.MGR") == col("m.EMPNO")]).select("m.*").distinct().join(dept, "DEPTNO")\
.filter((col("DLOC").isin(["NEW YORK", "DALLAS"])) & (year("HIREDATE") > 7)).show()

+------+-----+-----+---------+----+----------+------+----+----------+--------+
|DEPTNO|EMPNO|ENAME|      JOB| MGR|  HIREDATE|   SAL|COMM|     DNAME|    DLOC|
+------+-----+-----+---------+----+----------+------+----+----------+--------+
|    20| 7788|SCOTT|  ANALYST|7566|1982-12-09|3000.0|null|  RESEARCH|  DALLAS|
|    20| 7902| FORD|  ANALYST|7566|1981-12-03|3000.0|null|  RESEARCH|  DALLAS|
|    20| 7566|JONES|  MANAGER|7839|1981-04-02|2975.0|null|  RESEARCH|  DALLAS|
|    10| 7839| KING|PRESIDENT|null|1981-11-17|5000.0|null|ACCOUNTING|NEW YORK|
|    10| 7782|CLARK|  MANAGER|7839|1981-06-09|2450.0|null|ACCOUNTING|NEW YORK|
+------+-----+-----+---------+----+----------+------+----+----------+--------+

In [54]:
# 41. Display the Empno, Ename, Sal, Dname, Loc, Deptno, Job of all emps working at
# CJICAGO or working for ACCOUNTING dept with Ann Sal>28000, but the Sal
# should not be=3000 or 2800 who doesn’t belongs to the Mgr and whose no is
# having a digit ‘7’ or ‘8’ in 3 rd position in the asc order of Deptno and desc order
# of job.

In [55]:
# 42. Display the total information of the emps along with Grades in the asc order.

# emp.join(sal, emp.SAL.between(sal.LOSAL, sal.HISAL)).sort(asc("GRADE")).show() or

e = emp.alias("e")
s = sal.alias("s")

e.join(s, [col("e.SAL").between(col("s.LOSAL"), col("s.HISAL"))]).sort(asc("GRADE")).show()

+-----+------+---------+----+----------+------+-------+------+-----+------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|GRADE| LOSAL| HISAL|
+-----+------+---------+----+----------+------+-------+------+-----+------+------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20|    1| 700.0|1200.0|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|    1| 700.0|1200.0|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20|    1| 700.0|1200.0|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|    2|1201.0|1400.0|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|    2|1201.0|1400.0|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|    2|1201.0|1400.0|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|    3|1401.0|2000.0|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|    3|1401.0|2000.0|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20|    4|2001.0|3000.0|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|    4|2001.0|3000.0|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|    4|2001.0|3000.0|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20|    4|2001.0|3000.0|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|    4|2001.0|3000.0|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|    5|3001.0|9999.0|
+-----+------+---------+----+----------+------+-------+------+-----+------+------+

In [56]:
# 43. List all the Grade2 and Grade 3 emps.

e.join(s, [e.SAL.between(s.LOSAL, s.HISAL), s.GRADE.isin(2,3)]).show()

+-----+------+--------+----+----------+------+-------+------+-----+------+------+
|EMPNO| ENAME|     JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|GRADE| LOSAL| HISAL|
+-----+------+--------+----+----------+------+-------+------+-----+------+------+
| 7521|  WARD|SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|    2|1201.0|1400.0|
| 7654|MARTIN|SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|    2|1201.0|1400.0|
| 7499| ALLEN|SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|    3|1401.0|2000.0|
| 7934|MILLER|   CLERK|7782|1982-01-23|1300.0|   null|    10|    2|1201.0|1400.0|
| 7844|TURNER|SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|    3|1401.0|2000.0|
+-----+------+--------+----+----------+------+-------+------+-----+------+------+

In [57]:
# 44. Display all Grade 4,5 Analyst and Mgr.

e.join(s, [e.SAL.between(s.LOSAL, s.HISAL), s.GRADE.isin(4,5)]).show()

+-----+-----+---------+----+----------+------+----+------+-----+------+------+
|EMPNO|ENAME|      JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|GRADE| LOSAL| HISAL|
+-----+-----+---------+----+----------+------+----+------+-----+------+------+
| 7566|JONES|  MANAGER|7839|1981-04-02|2975.0|null|    20|    4|2001.0|3000.0|
| 7698|BLAKE|  MANAGER|7839|1981-05-01|2850.0|null|    30|    4|2001.0|3000.0|
| 7782|CLARK|  MANAGER|7839|1981-06-09|2450.0|null|    10|    4|2001.0|3000.0|
| 7788|SCOTT|  ANALYST|7566|1982-12-09|3000.0|null|    20|    4|2001.0|3000.0|
| 7839| KING|PRESIDENT|null|1981-11-17|5000.0|null|    10|    5|3001.0|9999.0|
| 7902| FORD|  ANALYST|7566|1981-12-03|3000.0|null|    20|    4|2001.0|3000.0|
+-----+-----+---------+----+----------+------+----+------+-----+------+------+

In [58]:
# 45. List the Empno, Ename, Sal, Dname, Grade, Exp, and Ann Sal of emps working
# for Dept10 or20.

e.join(s, [e.SAL.between(s.LOSAL, s.HISAL), s.GRADE.isin(4,5), e.DEPTNO.isin([10,20])]).show()

+-----+-----+---------+----+----------+------+----+------+-----+------+------+
|EMPNO|ENAME|      JOB| MGR|  HIREDATE|   SAL|COMM|DEPTNO|GRADE| LOSAL| HISAL|
+-----+-----+---------+----+----------+------+----+------+-----+------+------+
| 7566|JONES|  MANAGER|7839|1981-04-02|2975.0|null|    20|    4|2001.0|3000.0|
| 7782|CLARK|  MANAGER|7839|1981-06-09|2450.0|null|    10|    4|2001.0|3000.0|
| 7788|SCOTT|  ANALYST|7566|1982-12-09|3000.0|null|    20|    4|2001.0|3000.0|
| 7839| KING|PRESIDENT|null|1981-11-17|5000.0|null|    10|    5|3001.0|9999.0|
| 7902| FORD|  ANALYST|7566|1981-12-03|3000.0|null|    20|    4|2001.0|3000.0|
+-----+-----+---------+----+----------+------+----+------+-----+------+------+

In [59]:
#UDF with Lambda

def doubleSal(x):
    return int(x*2) #forcing here to convert type to integer otherwise it will return null

# Integer type output
from pyspark.sql.types import IntegerType
doubleSalUdf = udf(lambda z: doubleSal(z), IntegerType())

emp.withColumn("DoubSal", doubleSalUdf(col("SAL"))).show()

+-----+------+---------+----+----------+------+-------+------+-------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|DoubSal|
+-----+------+---------+----+----------+------+-------+------+-------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20|   1600|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|   3200|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|   2500|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20|   5950|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|   2500|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|   5700|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|   4900|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20|   6000|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|  10000|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|   3000|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20|   2200|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30|   1900|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|   6000|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|   2600|
+-----+------+---------+----+----------+------+-------+------+-------+

In [60]:
# udf with structType

schemaStruct = StructType([
    StructField("Sal", DoubleType()),
    StructField("Comm", DoubleType())
])


def salComm(sal, comm):
    return (sal+5, comm)


salCommUdf = udf(salComm, schemaStruct)

emp.withColumn("newCol", salCommUdf(emp.SAL, emp.COMM)).select("newCol.sal").show(truncate=True)

+------+
|   sal|
+------+
| 805.0|
|1605.0|
|1255.0|
|2980.0|
|1255.0|
|2855.0|
|2455.0|
|3005.0|
|5005.0|
|1505.0|
|1105.0|
| 955.0|
|3005.0|
|1305.0|
+------+

In [61]:
emp.withColumn("netSal", when(col("COMM").isNull(), col("SAL")).otherwise(col("COMM") + col("SAL"))).show()

+-----+------+---------+----+----------+------+-------+------+------+
|EMPNO| ENAME|      JOB| MGR|  HIREDATE|   SAL|   COMM|DEPTNO|netSal|
+-----+------+---------+----+----------+------+-------+------+------+
| 7369| SMITH|    CLERK|7902|1980-12-17| 800.0|   null|    20| 800.0|
| 7499| ALLEN| SALESMAN|7698|1981-02-20|1600.0| 300.00|    30|1900.0|
| 7521|  WARD| SALESMAN|7698|1981-02-22|1250.0| 500.00|    30|1750.0|
| 7566| JONES|  MANAGER|7839|1981-04-02|2975.0|   null|    20|2975.0|
| 7654|MARTIN| SALESMAN|7698|1981-09-28|1250.0|1400.00|    30|2650.0|
| 7698| BLAKE|  MANAGER|7839|1981-05-01|2850.0|   null|    30|2850.0|
| 7782| CLARK|  MANAGER|7839|1981-06-09|2450.0|   null|    10|2450.0|
| 7788| SCOTT|  ANALYST|7566|1982-12-09|3000.0|   null|    20|3000.0|
| 7839|  KING|PRESIDENT|null|1981-11-17|5000.0|   null|    10|5000.0|
| 7844|TURNER| SALESMAN|7698|1981-09-08|1500.0|   0.00|    30|1500.0|
| 7876| ADAMS|    CLERK|7788|1983-01-12|1100.0|   null|    20|1100.0|
| 7900| JAMES|    CLERK|7698|1981-12-03| 950.0|   null|    30| 950.0|
| 7902|  FORD|  ANALYST|7566|1981-12-03|3000.0|   null|    20|3000.0|
| 7934|MILLER|    CLERK|7782|1982-01-23|1300.0|   null|    10|1300.0|
+-----+------+---------+----+----------+------+-------+------+------+